Repository: tamrattamrat0506-code/tamrat_local_poultry
Catalog: */locale/om/LC_MESSAGES/django.po
Languages: om

source: EthioPoultry - Ethiopian Poultry Marketplace
om: EthioPoultry - Gabaa Horsiisa Lukkuu Itoophiyaa

source: Skip to main content
om: Gara ogummaa guddaa seenuu

source: Home
om: Mana

source: POULTRY
om: HORSIISA LUKKUU

source: Main navigation
om: Garaagarummaa guddaa

source: Marketplace
om: Gabaa

source: Add Item
om: Meeshaa dabaluu

source: Conversations
om: Haasawaa

source: Unread messages:
om: Ergaa hin dubbifne:

source: Contact Us
om: Nu qunnamaa

source: About
om: Waa'ee keenya

source: Sell
om: Gurguruu

source: User menu
om: Menyuu fayyadamaa

source: My Profile
om: Piroofaayila koo

source: Edit Profile
om: Piroofaayila gulaalu

source: Logout
om: Baʼuu

source: Register
om: Galmaaʼuu

source: Login
om: Seenuu

source: Toggle navigation
om: Garaagarummaa jijjiiraa

source: Designed by
om: Akkaataa ittiin ijaarame

source: Empowering Ethiopia's Poultry Farmers with Fairness & Growth
om: Horsiistota Lukkuu Itoophiyaa Cimsuu fi Guddina Waliin

source: Connecting Ethiopian poultry farmers with buyers nationwide
om: Horsiistota lukkuu Itoophiyaa daldaltoota biyya guutuu waliin walqunnamsiisuu

source: Browse Marketplace
om: Gabaa daawwadhu

source: Our Impact So Far
om: Dhiibbaa Keenya Ammaatti

source: Total Users
om: Fayyadamtoota Waliigalaa

source: Active Users
om: Fayyadamtoota Hojii Irraa Jiru

source: Items for Sale
om: Wantoota Gurgurtaa

source: Conversations Started
om: Haasawaawan Jalqabame

source: Join a growing community of Ethiopian poultry farmers, buyers, and experts. List your products, connect with partners, and start meaningful conversations today!
om: Jiraattota horsiistota lukkuu Itoophiyaa, daldaltoota, fi ogartootaa wajjin walitti makamtuu keessatti makamuuf. Oomisha keessan galmeessaa, hirmaattoota wajjin walqunnamtii godhaa, haasawa barbaachisaa qaban har'a jalqabaa!

source: Why We Built This Platform?
om: Maaliif Platforma Kun Ijaarree?

source: Stop Price Shocks, Grow with Confidence
om: Dhibee Gatii Dhabamsiisaa, Amansiin Waliin Guddadhaa

source: Did you know? 40%% of small poultry farmers lose profits due to unpredictable price swings. We're changing that.
om: Beektaa? 40%% horsiistota lukkuu xiqqaa galii isaanii gatii hin beekkamin irraa dhabu. Kun nuu jijjiirama.

source: → Real-time pricing + expert tips = steadier income for YOU.
om: → Gatii yeroo dhugaa + gorsa ogartootaa = galii tasgabbaa SIIF.

source: Connect Directly—No More Middlemen!
om: Gara Fuula Duraa—Dabalataan Hin Jiru!

source: Over 70%% of farmers struggle to find fair buyers. We link you directly to trusted traders, suppliers, and experts—cutting costs, boosting profits.
om: 70%% ol horsiistota daldaltoota sirrii argachuuf rakkisuu. Si daldaltoota amanamoo, oomishaa, fi ogartootaa wajjin walqunnamsiifna—kostii hir'isuu, galii dabarsuu.

source: Transparent Markets = Stronger Farmers
om: Gabaabummaa Gabaa = Horsiistota Cimaa

source: Rumors of 'shortages' hurt small farms. Truth: Ethiopia produces 300M+ eggs/year—enough for all! We expose manipulation and highlight REAL data.
om: Odeeffannoon 'hanga' horsiistota xiqqaa miidhuu. Dhugaa: Itoophiyaan bifi 300M+ eggs/year—hundaaf gahaa! Sochii jijjiiramaa agarsiifnaa fi daataa DHUGAA guddisna.
