Repository: tamrattamrat0506-code/tamrat_local_poultry
Catalog: */locale/*/LC_MESSAGES/django.po
Languages: am

source: EthioPoultry - Ethiopian Poultry Marketplace
am: ኢትዮፖልትሪ - የኢትዮጵያ የዶሮ ምርት ገበያ

source: Skip to main content
am: ወደ ዋናው ይዘት ይሂዱ

source: Home
am: መነሻ

source: POULTRY
am: የዶሮ �ቀቅ

source: Main navigation
am: ዋና አሰሳ

source: Marketplace
am: ገበያ

source: Add Item
am: ንብረት ያክሉ

source: Conversations
am: ውይይቶች

source: Unread messages:
am: ያልተነበቡ መልዕክቶች፦

source: Contact Us
am: ያግኙን

source: About
am: ስለ እኛ

source: Sell
am: ሽያጭ

source: User menu
am: የተጠቃሚ ምናሌ

source: My Profile
am: የኔ መገለጫ

source: Edit Profile
am: መገለጫ አርትዕ

source: Logout
am: ውጣ

source: Register
am: ይመዝገቡ

source: Login
am: ይግቡ

source: Toggle navigation
am: አሰሳ ቀያይር

source: Designed by
am: በዲዛይን የተሰራ

source: Empowering Ethiopia's Poultry Farmers with Fairness & Growth
am: የኢትዮጵያን የዶሮ እርባታ አርሶ አደሮች በአግባቡና በእድገት ማበረታታት

source: Connecting Ethiopian poultry farmers with buyers nationwide
am: የኢትዮጵያ የዶሮ እርሻ አርሶ አደሮችን ከገዢዎች ጋር በሀገር አቀፍ ሁኔታ እንዲገናኙ እናገናኛለን

source: Browse Marketplace
am: ገበያን ይመልከቱ

source: Our Impact So Far
am: እስካሁን ያለን ተጽዕኖ

source: Total Users
am: ጠቅላላ ተጠቃሚዎች

source: Active Users
am: ንቁ ተጠቃሚዎች

source: Items for Sale
am: ለመሸጥ የቀረቡ እቃዎች

source: Conversations Started
am: የተጀመሩ ውይይቶች

source: Join a growing community of Ethiopian poultry farmers, buyers, and experts. List your products, connect with partners, and start meaningful conversations today!
am: የኢትዮጵያን የዶሮ እርባታ አርሶ አደሮች፣ ገዢዎች እና ባለሙያዎች ያሉበት እየደረሰ ያለ ማህበረሰብ �ን ይቀላቀሉ። �ምርቶችዎን ይዝገቡ፣ ከአጋሮች ጋር ተገናኝተው ትርጉም ያለው ውይይት ይጀምሩ!

source: Why We Built This Platform?
am: ይህን መድረክ �ስላል እንደገነባነው?

source: Stop Price Shocks, Grow with Confidence
am: የዋጋ መዛባትን አቁሙ፣ በራስ መተማመን �ድረስ

source: Did you know? 40%% of small poultry farmers lose profits due to unpredictable price swings. We're changing that.
am: ያውቃሉ? 40%% የሚሆኑ አነስተኛ የዶሮ እርባታ አርሶ አደሮች በማያሻማ የዋጋ ለውጦች ምክንያት ትርፋቸውን ያጣሉ። እኛ ይህን እየቀየርን ነው።

source: → Real-time pricing + expert tips = steadier income for YOU.
am: → በቅጽበት የዋጋ መረጃ + የባለሙያ ምክሮች = የበለጠ የተረጋጋ ገቢ ለእርስዎ።

source: Connect Directly—No More Middlemen!
am: በቀጥታ ይገናኙ - መካከለኛዎች አያስፈልጉም!

source: Over 70%% of farmers struggle to find fair buyers. We link you directly to trusted traders, suppliers, and experts—cutting costs, boosting profits.
am: ከ70%% በላይ የሚሆኑ አርሶ አደሮች ፍትሃዊ ገዢዎችን ለማግኘት ይቸገራሉ። እኛ እርስዎን በቀጥታ ከታመኑ ነጋዴዎች፣ አቅራቢዎች እና ባለሙያዎች ጋር እናገናኝዎታለን - �ስጫዎችን በመቀነስ ትርፍ እናሳድጋለን።

source: Transparent Markets = Stronger Farmers
am: ግልጽ የሆኑ ገበያዎች = የበለጠ ጠንካራ አርሶ አደሮች

source: Rumors of 'shortages' hurt small farms. Truth: Ethiopia produces 300M+ eggs/year—enough for all! We expose manipulation and highlight REAL data.
am: 'ጉድለት' የሚሉ ጠብመንገዶች አነስተኛ እርባታዎችን ይጎዳሉ። እውነታ፡ ኢትዮጵያ በየዓመቱ ከ300 ሚሊዮን በላይ እንቁላል ትመርታለች - ለሁሉም በቂ! እኛ ማጭበርበርን እንገልፃለን እና እውነተኛ ዳታን እናብራራለን።
